-- phpMyAdmin SQL Dump
-- version 3.2.4
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: Apr 05, 2022 at 05:47 PM
-- Server version: 5.1.41
-- PHP Version: 5.3.1

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `cpap`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_position`
--

CREATE TABLE IF NOT EXISTS `tb_position` (
  `position_code` char(255) NOT NULL DEFAULT '',
  `position_code1` varchar(255) DEFAULT NULL,
  `position_name` char(255) DEFAULT NULL,
  `position_nameAB` char(255) DEFAULT NULL,
  `position_name1` char(255) DEFAULT NULL,
  `pp_code` char(255) DEFAULT NULL,
  PRIMARY KEY (`position_code`)
) ENGINE=MyISAM DEFAULT CHARSET=tis620;

--
-- Dumping data for table `tb_position`
--

INSERT INTO `tb_position` (`position_code`, `position_code1`, `position_name`, `position_nameAB`, `position_name1`, `pp_code`) VALUES
('00', '00', NULL, NULL, NULL, NULL),
('43', '43', 'พนักงานธุรการ', NULL, 'พนักงานธุรการ', NULL),
('47', '47', 'พนักงานบริการทั่วไป(คนงาน)', NULL, 'พนักงานบริการทั่วไป(คนงาน)', NULL),
('44', '44', 'ช่างเขียนแบบ', NULL, 'ช่างเขียนแบบ', NULL),
('55', '55', 'เภสัชกร', '', 'เภสัชกร', ''),
('56', '56', 'พนักงานบัญชี', NULL, 'พนักงานบัญชี', NULL),
('57', '57', 'พนักงานผู้ช่วยทางการแพทย์', NULL, 'พนักงานผู้ช่วยทางการแพทย์', NULL),
('58', '58', 'แพทย์จีน', NULL, 'แพทย์จีน', NULL),
('59', '59', 'นักฟิสิกส์การแพทย์', NULL, 'นักฟิสิกส์การแพทย์', NULL),
('60', '60', 'ผู้จัดการ (LASIK)', NULL, 'ผู้จัดการ (LASIK)', NULL),
('61', '61', 'พนักงานการเงิน', NULL, 'พนักงานการเงิน', NULL),
('62', '62', 'นักเคมีรังสี', NULL, 'นักเคมีรังสี', NULL),
('63', '63', 'นักเภสัชรังสี', NULL, 'นักเภสัชรังสี', NULL),
('64', '64', 'นักรังสีการแพทย์', NULL, 'นักรังสีการแพทย์', NULL),
('65', '65', 'แพทย์', NULL, 'แพทย์', NULL),
('66', '66', 'พนักงานเวชระเบียน', NULL, 'พนักงานเวชระเบียน', NULL),
('67', '67', 'พนักงานบริหารงานทั่วไป', NULL, 'พนักงานบริหารงานทั่วไป', NULL),
('68', '68', 'พนักงานเก็บเงิน', NULL, 'พนักงานเก็บเงิน', NULL),
('69', '69', 'แพทย์แผนไทยประยุกต์', NULL, 'แพทย์แผนไทยประยุกต์', NULL),
('70', '70', 'ช่างไฟฟ้า', NULL, 'ช่างไฟฟ้า', NULL),
('71', '71', 'พนักงานเปล', NULL, 'พนักงานเปล', NULL),
('72', '72', 'พนักงานผู้ช่วยเภสัชกร', NULL, 'พนักงานผู้ช่วยเภสัชกร', NULL),
('73', '73', 'นักเทคนิคการแพทย์', NULL, 'นักเทคนิคการแพทย์', NULL),
('74', '74', 'นักกายภาพบำบัด', NULL, 'นักกายภาพบำบัด', NULL),
('75', '75', 'พนักงานขับรถยนต์', NULL, 'พนักงานขับรถยนต์', NULL),
('76', '76', 'พนักงานผู้ช่วยทางการแพทย์', NULL, 'พนักงานผู้ช่วยทางการแพทย์', NULL),
('77', '77', 'นักวิชาการคอมพิวเตอร์', NULL, 'นักวิชาการคอมพิวเตอร์', NULL),
('78', '78', 'นักกิจกรรมบำบัด', NULL, 'นักกิจกรรมบำบัด', NULL),
('79', '79', 'พนักงานโภชนาการ', NULL, 'พนักงานโภชนาการ', NULL),
('80', '80', 'นักโภชนาการ', NULL, 'นักโภชนาการ', NULL),
('81', '81', 'พนักงานเปล', NULL, 'พนักงานเปล', NULL),
('82', '82', 'พนักงานเครื่องคอมพิวเตอร์', NULL, 'พนักงานเครื่องคอมพิวเตอร์', NULL),
('83', '83', 'พนักงานประชาสัมพันธ์', NULL, 'พนักงานประชาสัมพันธ์', NULL),
('84', '84', 'พนักงานธุรการ (พัสดุ)', NULL, 'พนักงานธุรการ (พัสดุ)', NULL),
('85', '85', 'พนักงานกายภาพบำบัด', NULL, 'พนักงานกายภาพบำบัด', NULL),
('86', '86', 'พนักงานการตลาด', NULL, 'พนักงานการตลาด', NULL),
('87', '87', 'เจ้าหน้าที่ตรวจการนอนหลับ', NULL, 'เจ้าหน้าที่ตรวจการนอนหลับ', NULL),
('88', '88', 'วิศวกรระบบเครือข่าย', NULL, 'วิศวกรระบบเครือข่าย', NULL),
('89', '89', 'พยาบาล', NULL, 'พยาบาล', NULL),
('90', '90', 'พนักงานบริหารงานทั่วไป (บุคคล)', NULL, 'พนักงานบริหารงานทั่วไป (บุคคล)', NULL),
('91', '91', 'เจ้าหน้าที่การเงินและบัญชี', NULL, 'เจ้าหน้าที่การเงินและบัญชี', NULL),
('92', '92', 'พนักงานต้อนรับ', NULL, 'พนักงานต้อนรับ', NULL),
('93', '93', 'ผู้จัดการ (TTCM)', NULL, 'ผู้จัดการ (TTCM)', NULL),
('94', '94', 'พนักงานธุรการ (กายภาพบำบัด)', NULL, 'พนักงานธุรการ (กายภาพบำบัด)', NULL),
('95', '95', 'พนักงานผู้ช่วยทางการแพทย์ (กายภาพบำบัด)', NULL, 'พนักงานผู้ช่วยทางการแพทย์ (กายภาพบำบัด)', NULL),
('96', '96', 'พนักงานโภชนาการ (กุ๊ก)', NULL, 'พนักงานโภชนาการ (กุ๊ก)', NULL),
('97', '97', 'พนักงานโภชนาการ (ผู้ช่วยกุ๊ก)', NULL, 'พนักงานโภชนาการ (ผู้ช่วยกุ๊ก)', NULL),
('98', '98', 'ผู้อำนวยการศูนย์', NULL, 'ผู้อำนวยการศูนย์', NULL),
('99', '99', 'รองผู้อำนวยการ', NULL, 'รองผู้อำนวยการ', NULL),
('01', '01', 'หัวหน้าศูนย์', NULL, 'หัวหน้าศูนย์', NULL),
('02', '02', 'รักษาการแทน เลขานุการศูนย์', NULL, 'รักษาการแทน เลขานุการศูนย์', NULL);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
